// 
// СУ "Св. Климент Охридски"
// Факултет по математика и информатика
// Курс Обектно-ориентирано програмиране 2020/21
// Контролно 1
// 
// Име: Снежана Йорданова Чолакова
// ФН: 45661
// Специалност: Информатика
// Курс: 1
// Административна група: 3
// Ден, в който се явявате на контролното: 17/04/2021
// Начален час на контролното: 08:00
// Кой компилатор използвате: GCC
//

#define _CRT_SECURE_NO_WARNINGS 

#include <cassert>
#include <cstring>
#include <iostream>
#include <string>

int main()
{
	class Registration {

		char regnumber[9];

	};
	return 0;
}