//
// СУ "Св. Климент Охридски"
// Факултет по математика и информатика
// Курс Обектно-ориентирано програмиране 2020/21
// Контролно 1
//
// Име:
// ФН:
// Специалност:
// Курс:
// Административна група:
// Ден, в който се явявате на контролното:
// Начален час на контролното: <тук попълнете часа за вашата група>
// Кой компилатор използвате: <посочете едно от Visual C++, GCC или Clang>
//

// (Можете да изтриете този коментар след като го прочетете)
// Редът по-долу е специфичен за Visual C++.
// Ако използвате друг компилатор, можете да го изтриете.
// Тъй като strlen, strcmp и т.н. са дефинирани като deprecated,
// имате две възможности:
//
// * да използвате безопасните версии на тези функции
//   (strlen_s, strcmp_s и т.н.). В този случай можете да
//   изтриете дадената по-долу #define директива.
//
// * да дефинирате _CRT_SECURE_NO_WARNINGS преди да
//   включите съответните header файлове от стандартната
//   библиотека.
//
#define _CRT_SECURE_NO_WARNINGS

#include <cassert>
#include <cstring>
#include <iostream>
#include <string>

using namespace std;
int main(){



int i=0,m=0,n=0;
bool t=false;
char a[9];

cout<<"Vuvedete nomer(XX1111YY/X1111YY): ";
cin>>a;


while(i<8){


if(a[i]>='a' && a[i]<='z' || a[i]>='A' && a[i]<='Z'){m++;}
if(t==true  && a[i]>='1' && a[i]<='9'){n++;}
if(t==false){

if(i==1 && m==2 || m==1){t=true;if(m==1){i++;m=0;}
else m=-1;
}
else {break;}



}

if(t==true && i==6 && n!=4){if(n==3){n++;}
else break;}


i++;
}
if(n==4 && m==2)cout<<"Veren nomer";
else cout<<"Greshen nomer";


cout<<"\n";



return 0;
}
