//
// Created by Yani Drenchev on 10.05.21.
//
/*
 *  Р Р°Р·Р±РёСЂР° СЃРµ, РєР»Р°СЃРёС‡РµСЃРєРё РЅР°С‡РёРЅ РґР° РїСЂРѕРІРµСЂСЏРІР°РјРµ РєРѕРјР°РЅРґРёС‚Рµ, Р·Р°С‰РѕС‚Рѕ РјРѕР¶РµРј Р»РµСЃРЅРѕ
 *  СЃСЉСЃ Switch, РґР° РјРёРЅР°РІР°РјРµ РїСЂРµР· С‚СЏС…. NIL РёР·РїРѕР»Р·РІР°Рј, РєР°С‚Рѕ "РіСЂРµС€РєР°" Р°РєРѕ РЅР°РїСЂРёРјРµСЂ Рµ РїРѕРґР°РґРµРЅР°
 *  РЅРµРІР°Р»РёРґРЅР° РєРѕРјР°РЅРґР° РёР»Рё РїСЉРє РЅРµРІР°Р»РёРґРµРЅ Р±СЂРѕР№ Р°СЂРіСѓРјРµРЅС‚Рё, СЂР°Р·Р±РёСЂР° СЃРµ РјРѕР¶Рµ РґР° СЃРµ РЅР°РїСЂР°РІРё РґР° СЃРµ РёР·РїРёР·РІР°
 *  РєСЉРґРµ РєР°РєРІРѕ Рµ СЃРіСЂРµС€РµРЅРѕ, РЅРѕ РЅРµ СЃРµ РёСЃРєР° РІ Р·Р°РґР°РЅРёРµС‚Рѕ :).
 * */
#ifndef HOMEWORK2_COMMANDCODE_H
#define HOMEWORK2_COMMANDCODE_H

enum class CommandCode{
    NIL,
    VEHICLE,
    PERSON,
    ACQUIRE,
    RELEASE,
    REMOVE,
    SAVE,
    SHOW,
    EXIT
};

#endif //HOMEWORK2_COMMANDCODE_H
