// СУ "Св. Климент Охридски"
// Факултет по математика и информатика
// Курс Обектно-ориентирано програмиране 2020/21
// Контролно 1
//
// Име:Ема Кючукова
// ФН:81919
// Специалност: КН
// Курс:2
// Административна група:1
// Ден, в който се явявате на контролното:24.04
// Начален час на контролното: 9:30
// Кой компилатор използвате: <посочете едно от Visual C++, GCC или Clang>
//



#include <cassert>
#include <cstddef>
#include <iostream>
#include <cstdlib>
#include <stdexcept>

int main()
{

	return 0;
}
