//
// СУ "Св. Климент Охридски"
// Факултет по математика и информатика
// Курс Обектно-ориентирано програмиране 2020/21
// Практически изпит
//
// Име: Теодор Христов
// ФН:  45799
// Специалност: Информатика
// Курс: 1
// Административна група: 4
// Ден, в който се явявате на изпита: 14.07.2021
// Начален час на изпита: 9:00
// Кой компилатор използвате: g++
//

// (Можете да изтриете този коментар след като го прочетете)
// Редът по-долу е специфичен за Visual C++.
// Ако използвате друг компилатор, можете да го изтриете.
// Тъй като strlen, strcmp и т.н. са дефинирани като deprecated,
// имате две възможности:
//
// * да използвате безопасните версии на тези функции
//   (strlen_s, strcmp_s и т.н.). В този случай можете да
//   изтриете дадената по-долу #define директива.
//
// * да дефинирате _CRT_SECURE_NO_WARNINGS преди да
//   включите съответните header файлове от стандартната
//   библиотека.
//
#define _CRT_SECURE_NO_WARNINGS

#include <iostream>
#include <vector>
#include "Configuration.h"
#include "Utils.cpp"

int main() {
    std::cout << "Welcome to Zimbu's shop!\n";
    Configuration* conf = Configuration::create_configuration();

    std::cout << *conf;

    delete conf;
    return 0;
}
